ZhiKong0/nolebase-template/笔记/MCU_Learning/STM32学习/01基础/06I2C/I2C-Project/04-封装(SoftIIC+IIC+OLED)/Hardware/IIC/OLED.c
#include "stm32f10x.h"
#include "OLED_Font.h"
#include "SoftIIC.h"

/* OLED 设备地址 */
#define OLED_ADDRESS    0x78

/**
 * @brief  OLED 写命令
 * @param  Command 要写入的命令
 * @retval None
 * @note   使用软I2C发送，格式：[0x78 地址] [0x00 控制字节] [Command 命令]
 */
void OLED_WriteCommand(uint8_t Command)
{
    SoftIIC_Start();
    SoftIIC_SendByte(OLED_ADDRESS);
    if (SoftIIC_WaitACK() != 0) {
        SoftIIC_Stop();
        return;
    }
    
    SoftIIC_SendByte(0x00);  // 控制字节：0x00 = 命令
    if (SoftIIC_WaitACK() != 0) {
        SoftIIC_Stop();
        return;
    }
    
    SoftIIC_SendByte(Command);
    SoftIIC_WaitACK();
    SoftIIC_Stop();
}

/**
 * @brief  OLED 写数据
 * @param  Data 要写入的数据
 * @retval None
 * @note   使用软I2C发送，格式：[0x78 地址] [0x40 控制字节] [Data 数据]
 */
void OLED_WriteData(uint8_t Data)
{
    SoftIIC_Start();
    SoftIIC_SendByte(OLED_ADDRESS);
    if (SoftIIC_WaitACK() != 0) {
        SoftIIC_Stop();
        return;
    }
    
    SoftIIC_SendByte(0x40);  // 控制字节：0x40 = 数据
    if (SoftIIC_WaitACK() != 0) {
        SoftIIC_Stop();
        return;
    }
    
    SoftIIC_SendByte(Data);
    SoftIIC_WaitACK();
    SoftIIC_Stop();
}

/**
  * @brief  OLED设置光标位置
  * @param  Y 以左上角为原点，向下方向的坐标，范围：0~7
  * @param  X 以左上角为原点，向右方向的坐标，范围：0~127
  * @retval 无
  */
void OLED_SetCursor(uint8_t Y, uint8_t X)
{
	OLED_WriteCommand(0xB0 | Y);					//设置Y位置
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4));	//设置X位置高4位
	OLED_WriteCommand(0x00 | (X & 0x0F));			//设置X位置低4位
}

/**
  * @brief  OLED清屏
  * @param  无
  * @retval 无
  */
void OLED_Clear(void)
{  
	uint8_t i, j;
	for (j = 0; j < 8; j++)
	{
		OLED_SetCursor(j, 0);
		for(i = 0; i < 128; i++)
		{
			OLED_WriteData(0x00);
		}
	}
}

/**
  * @brief  OLED显示一个字符
  * @param  Line 行位置，范围：1~4
  * @param  Column 列位置，范围：1~16
  * @param  Char 要显示的一个字符，范围：ASCII可见字符
  * @retval 无
  */
void OLED_ShowChar(uint8_t Line, uint8_t Column, char Char)
{      	
	uint8_t i;
	OLED_SetCursor((Line - 1) * 2, (Column - 1) * 8);		//设置光标位置在上半部分
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData(OLED_F8x16[Char - ' '][i]);			//显示上半部分内容
	}
	OLED_SetCursor((Line - 1) * 2 + 1, (Column - 1) * 8);	//设置光标位置在下半部分
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData(OLED_F8x16[Char - ' '][i + 8]);		//显示下半部分内容
	}
}

/**
  * @brief  OLED显示字符串
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  String 要显示的字符串，范围：ASCII可见字符
  * @retval 无
  */
void OLED_ShowString(uint8_t Line, uint8_t Column, char *String)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i++)
	{
		OLED_ShowChar(Line, Column + i, String[i]);
	}
}

/**
  * @brief  OLED次方函数
  * @retval 返回值等于X的Y次方
  */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while (Y--)
	{
		Result *= X;
	}
	return Result;
}

/**
  * @brief  OLED显示数字（十进制，正数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：0~4294967295
  * @param  Length 要显示数字的长度，范围：1~10
  * @retval 无
  */
void OLED_ShowNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(10, Length - i - 1) % 10 + '0');
	}
}

/**
  * @brief  OLED显示数字（十进制，带符号数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：-2147483648~2147483647
  * @param  Length 要显示数字的长度，范围：1~10
  * @retval 无
  */
void OLED_ShowSignedNum(uint8_t Line, uint8_t Column, int32_t Number, uint8_t Length)
{
	uint8_t i;
	uint32_t Number1;
	if (Number >= 0)
	{
		OLED_ShowChar(Line, Column, '+');
		Number1 = Number;
	}
	else
	{
		OLED_ShowChar(Line, Column, '-');
		Number1 = -Number;
	}
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar(Line, Column + i + 1, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0');
	}
}

/**
  * @brief  OLED显示数字（十六进制，正数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：0~0xFFFFFFFF
  * @param  Length 要显示数字的长度，范围：1~8
  * @retval 无
  */
void OLED_ShowHexNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i, SingleNumber;
	for (i = 0; i < Length; i++)							
	{
		SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;
		if (SingleNumber < 10)
		{
			OLED_ShowChar(Line, Column + i, SingleNumber + '0');
		}
		else
		{
			OLED_ShowChar(Line, Column + i, SingleNumber - 10 + 'A');
		}
	}
}

/**
  * @brief  OLED显示数字（二进制，正数）
  * @param  Line 起始行位置，范围：1~4
  * @param  Column 起始列位置，范围：1~16
  * @param  Number 要显示的数字，范围：0~1111 1111 1111 1111
  * @param  Length 要显示数字的长度，范围：1~16
  * @retval 无
  */
void OLED_ShowBinNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(2, Length - i - 1) % 2 + '0');
	}
}

/**
 * @brief  OLED 显示一个字符（像素级定位）
 * @param  x 水平位置（0-127，左上角为原点向右）
 * @param  y 垂直位置（0-63，左上角为原点向下）
 * @param  Char 要显示的字符
 * @retval None
 * @note   可在任意像素位置显示字符，自动处理跨页和边界截断
 *         字符高度 16 像素，宽度 8 像素
 */
void OLED_ShowCharAt(uint8_t x, uint8_t y, char Char)
{
    uint8_t i;
    uint8_t upper_y, lower_y;      // 字符跨越的两个 Page
    uint8_t upper_offset;          // 在 Page 内的偏移（0-7）
    
    // 边界检查：如果完全超出屏幕则不显示
    if (x > 127 || y > 63) return;
    
    // 计算字符跨越的 Page
    upper_y = y / 8;                // 上层 Page（0-7）
    lower_y = (y + 15) / 8;         // 下层 Page（可能等于上层，如果 y 在 Page 边界上）
    upper_offset = y % 8;           // 在 Page 内的偏移量（0-7）
    
    // 获取字模指针（16字节：前8字节上半部，后8字节下半部）
    const uint8_t *font = OLED_F8x16[Char - ' '];
    
    // 显示上半部分（上层 Page）
    OLED_SetCursor(upper_y, x);
    for (i = 0; i < 8; i++)
    {
        uint8_t data = font[i];
        // 如果字符跨越 Page 边界，需要移位
        if (upper_offset != 0)
        {
            data >>= upper_offset;  // 向下偏移，上半部分被截断
            // 下半部分的数据需要移入
            if (lower_y > upper_y && i < 8)
            {
                data |= (font[i + 8] << (8 - upper_offset));
            }
        }
        OLED_WriteData(data);
    }
    
    // 显示下半部分（下层 Page，如果跨越了 Page）
    if (lower_y > upper_y && lower_y < 8)
    {
        OLED_SetCursor(lower_y, x);
        for (i = 0; i < 8; i++)
        {
            uint8_t data = font[i + 8];
            // 如果有偏移，下半部分也需要移位
            if (upper_offset != 0)
            {
                data >>= upper_offset;
            }
            OLED_WriteData(data);
        }
    }
}

/**
 * @brief  OLED 显示字符串（像素级定位）
 * @param  x 起始水平位置（0-127）
 * @param  y 起始垂直位置（0-63）
 * @param  String 要显示的字符串
 * @retval None
 * @note   可在任意像素位置显示字符串，自动换行和截断
 */
void OLED_ShowStringAt(uint8_t x, uint8_t y, char *String)
{
    uint8_t cur_x = x;
    uint8_t cur_y = y;
    uint8_t i;
    
    for (i = 0; String[i] != '\0'; i++)
    {
        // 如果当前位置超出屏幕宽度，换行
        if (cur_x > 120)  // 128 - 8 = 120，字符宽度 8
        {
            cur_x = 0;
            cur_y += 16;  // 字符高度 16
        }
        
        // 如果超出屏幕高度，停止显示
        if (cur_y > 48)  // 64 - 16 = 48
        {
            return;
        }
        
        OLED_ShowCharAt(cur_x, cur_y, String[i]);
        cur_x += 8;  // 字符宽度 8
    }
}

/**
 * @brief  OLED初始化
 * @param  无
 * @retval 无
 */
void OLED_Init(void)
{
	uint32_t i, j;
	
	// 软件I2C初始化（PB7/PB8）
	SoftIIC_Init();
	
	for (i = 0; i < 1000; i++)			//上电延时
	{
		for (j = 0; j < 1000; j++);
	}
	
	OLED_WriteCommand(0xAE);	//关闭显示
	
	OLED_WriteCommand(0xD5);	//设置显示时钟分频比/振荡器频率
	OLED_WriteCommand(0x80);
	
	OLED_WriteCommand(0xA8);	//设置多路复用率
	OLED_WriteCommand(0x3F);
	
	OLED_WriteCommand(0xD3);	//设置显示偏移
	OLED_WriteCommand(0x00);
	
	OLED_WriteCommand(0x40);	//设置显示开始行
	
	OLED_WriteCommand(0xA1);	//设置左右方向，0xA1正常 0xA0左右反置
	
	OLED_WriteCommand(0xC8);	//设置上下方向，0xC8正常 0xC0上下反置

	OLED_WriteCommand(0xDA);	//设置COM引脚硬件配置
	OLED_WriteCommand(0x12);
	
	OLED_WriteCommand(0x81);	//设置对比度控制
	OLED_WriteCommand(0xCF);

	OLED_WriteCommand(0xD9);	//设置预充电周期
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB);	//设置VCOMH取消选择级别
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4);	//设置整个显示打开/关闭

	OLED_WriteCommand(0xA6);	//设置正常/倒转显示

	OLED_WriteCommand(0x8D);	//设置充电泵
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF);	//开启显示
		
	OLED_Clear();				//OLED清屏
}
